Торговля_11__демо/src/DataProcessors/ЯндексМаркетВитринаФулфилмент/ЯндексМаркетВитринаФулфилмент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЯндексМаркетВитринаФулфилмент</name>
</mdclass:DataProcessor>

Торговля_11__демо/src/InformationRegisters/СтатусыПубликацииТоваровЯндексМаркет/СтатусыПубликацииТоваровЯндексМаркет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыПубликацииТоваровЯндексМаркет</name>
  <resources>
    <name>ИдентификаторПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВыгрузкиТоваровЯндексМаркет</types>
    </type>
  </resources>
  <resources>
    <name>Выбран</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПредставлениеТовара</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторТовараПлощадки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеТовараПлощадки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКатегорииПлощадки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМоделиПлощадки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГиперссылкаНаРекомендованныеТовар</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПродажи</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркерСтатуса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьИдентификаторПлощадки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУстановкиЦены</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокВУпаковках</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Торговля_11__демо/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркетинговоеМероприятие</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Торговля_11__демо/src/InformationRegisters/ЦеныНоменклатуры25/ЦеныНоменклатуры25.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры25</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.Цена</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <attributes>
    <name>МаркетинговоеМероприятие</name>
    <type>
      <types>CatalogRef.МаркетинговыеМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Формула</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаЦО</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатурыДляЦенообразования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СерияЦО</name>
    <type>
      <types>CatalogRef.СерииНоменклатурыДляЦенообразования</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УпаковкаЦО</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Торговля_11__демо/src/Enums/СтатусыВыгрузкиТоваровЯндексМаркет/СтатусыВыгрузкиТоваровЯндексМаркет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВыгрузкиТоваровЯндексМаркет</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ПолученаРекомендация</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПриПолученииРекомендации</name>
  </enumValues>
  <enumValues>
    <name>РекомендацияНеНайдена</name>
  </enumValues>
  <enumValues>
    <name>УтвержденаРекомендация</name>
  </enumValues>
  <enumValues>
    <name>НаМодерации</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПриОтправкеНаМодерацию</name>
  </enumValues>
  <enumValues>
    <name>МодерацияПройдена</name>
  </enumValues>
  <enumValues>
    <name>МодерацияНеПройдена</name>
  </enumValues>
  <enumValues>
    <name>НевернаяРекомендация</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетМодерации</name>
  </enumValues>
  <enumValues>
    <name>СозданиеНового</name>
  </enumValues>
</mdclass:Enum>

Торговля_11__демо/src/Enums/СпособыЗаданияЦен/СпособыЗаданияЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыЗаданияЦен</name>
  <enumValues>
    <name>Вручную</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнятьПоДаннымИБ</name>
  </enumValues>
  <enumValues>
    <name>РассчитыватьПоФормуламОтДругихВидовЦен</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнятьПоДаннымИБПриПоступлении</name>
  </enumValues>
  <enumValues>
    <name>НаценкаНаЦенуПоступления</name>
  </enumValues>
  <enumValues>
    <name>НаценкаНаЦенуВводаОстатков</name>
  </enumValues>
  <enumValues>
    <name>НаценкаНаДругойВидЦен</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнятьПоДаннымИБПоСебестоимости</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнятьПоДаннымИБПоПоставщикам</name>
  </enumValues>
  <enumValues>
    <name>ЗаполнятьПоДаннымИБПоКонкурентам</name>
  </enumValues>
  <enumValues>
    <name>ЗагружаетсяИзЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>ЗагружаетсяСOzon</name>
  </enumValues>
</mdclass:Enum>

Торговля_11__демо/src/DataProcessors/ЯндексМаркетВитринаФулфилмент/Forms/ВыгрузкаТоварногоКаталога/Module.bsl
&НаСервере
Процедура ЗаполнитьИнформациюВПодсказках()
	
	Элементы.ПодсказкаУтверждениеРекомендаций.Заголовок = "Вам необходимо проверить рекомендации о соответствии карточек товаров Яндекс.Маркета Вашему товару. Если рекомендация кажется Вам подходящей - утвердите рекомендацию, иначе - отклоните. После утверждения рекоменации выбранные позиции будут исключены из перечня для утверждения и отправятся на модерацию в Яндекс.Маркет. После успешного завершения модерации товарная позиция будет привязана к карточке товара площадки. В случае отклонения выбранные позиции будут исключены из перечня для утверждения и пересены в раздел ""Исправление ошибок публикации"" с комментарием ""Неверно подобранная рекомендация"".";
	Элементы.ПодсказкаПросмотрИРедактированиеАссортимента.Заголовок = "Выгрузка товарного каталога осуществляется в четыре этапа:
	|	Шаг 1. Получите рекомендованные SKU на Яндексе для ваших товаров. Добавьте публикуемые товары в таблицу ниже и дождитесь статуса ""Получена рекомендация"". Вы можете использовать базовый прайс-лист для заполнения данных об ассортименте.
	|	Шаг 2. Сверьте информацию от Маркета с вашим ассортиментом. Перейдите на закладку ""Утверждение рекомендаций"" и ознакомтесь с полученнной информацией. Утвердите рекомендации, которые считаете верными, отклоните, если рекомендация ошибочна.
	|	Шаг 3. При необходимости обработайте проблемные позиции на закладке ""Исправление ошибок при публикации"".
	|	Шаг 4. Дождитесь результатов модерации товаров (обработка может занимать до двух дней). Статус публикации ""Модерация пройдена"" означает, что вы можете переходить к установке цен.";
	
	Элементы.ПодсказкаИсправлениеОшибок.Заголовок = "Ознакомьтесь с описанием ошибок, уточните данные о товаре при необходимости. После отработки замечаний вы можете отправить данные о товаре повторно на получение рекомендации или на создание связи. В случае, если проблему устранить невозможно (например, товары указаннной категории не размещаются на площадке), вы можете не показывать товар в ассортименте.";
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеПоУчетнойЗаписи()
	
	ДанныеУчетнойЗаписиЯндексМаркет = ИнтеграцияСЯндексМаркетСервер.ДанныеУчетнойЗаписиЯндексМаркет();
	УчетнаяЗапись = ДанныеУчетнойЗаписиЯндексМаркет.УчетнаяЗапись;
	ВидЦен = ДанныеУчетнойЗаписиЯндексМаркет.ЦенаПродажи;
	ИсточникКатегории = ДанныеУчетнойЗаписиЯндексМаркет.ИсточникКатегории;	
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПросмотрИРедактированиеАссортимента;
	ЗаполнитьИнформациюВПодсказках();
	ЗаполнитьДанныеПоУчетнойЗаписи();
	ОбновитьТаблицуЦенНаСервере();

КонецПроцедуры

&НаСервере
Процедура ПриАктивацииГиперСсылкиНаПанели(ИмяАктивнойКнопки)
	
	МассивИменКнопокПанели = Новый Массив;
	МассивИменКнопокПанели.Добавить("КнопкаПросмотрИРедактированиеАссортимента");
	МассивИменКнопокПанели.Добавить("КнопкаУтверждениеРекомендаций");
	МассивИменКнопокПанели.Добавить("КнопкаИсправлениеОшибок");
	МассивИменКнопокПанели.Добавить("КнопкаПросмотрАктуальныхЦен");
	
	Для Каждого Эл Из МассивИменКнопокПанели Цикл
		Если Эл = ИмяАктивнойКнопки Тогда
			Элементы[Эл].ЦветТекста =  Новый Цвет(160,160,160); 	
		Иначе
			Элементы[Эл].ЦветТекста =  Новый Цвет(28,85,174); 
		КонецЕсли;
	КонецЦикла;
	
	ИмяСтраницы = СтрЗаменить(ИмяАктивнойКнопки,"Кнопка","Группа");
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы[ИмяСтраницы];
	
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрИРедактированиеАссортимента(Команда)
	
	ПриАктивацииГиперСсылкиНаПанели("КнопкаПросмотрИРедактированиеАссортимента");
	Элементы.Ассортимент.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура УтверждениеРекомендаций(Команда)
	
	ПриАктивацииГиперСсылкиНаПанели("КнопкаУтверждениеРекомендаций");
	Элементы.УтверждениеАссортимента.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправлениеОшибок(Команда)
	
	ПриАктивацииГиперСсылкиНаПанели("КнопкаИсправлениеОшибок");
	Элементы.ИсправлениеОшибок.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура СкрытьПодсказку(Команда)
	
	ИмяЭлементаПодсказки = СтрЗаменить(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя,"Группа","Подсказка");
	ИмяЭлементаОтступ =  СтрЗаменить(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя,"Группа","ДекорацияОтступ");
	ИмяКнопкиСкрыть = СтрЗаменить(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя,"Группа","СкрытьПодсказку"); 
	ИмяКнопкиПоказать = СтрЗаменить(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя,"Группа","ПоказатьПодсказку");
	
	Элементы[ИмяЭлементаПодсказки].Видимость = Ложь;
	Элементы[ИмяЭлементаОтступ].Видимость = Ложь;
	Элементы[ИмяКнопкиСкрыть].Видимость = Ложь;
	Элементы[ИмяКнопкиПоказать].Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьПодсказку(Команда)
	
	ИмяЭлементаПодсказки = СтрЗаменить(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя,"Группа","Подсказка");
	ИмяЭлементаОтступ =  СтрЗаменить(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя,"Группа","ДекорацияОтступ");
	ИмяКнопкиСкрыть = СтрЗаменить(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя,"Группа","СкрытьПодсказку"); 
	ИмяКнопкиПоказать = СтрЗаменить(Элементы.ГруппаСтраницы.ТекущаяСтраница.Имя,"Группа","ПоказатьПодсказку");
	
	Элементы[ИмяЭлементаПодсказки].Видимость = Истина;
	Элементы[ИмяЭлементаОтступ].Видимость = Истина;
	Элементы[ИмяКнопкиСкрыть].Видимость = Истина;
	Элементы[ИмяКнопкиПоказать].Видимость = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзменениеФлагаВыбран(ВыбраннаяСтрока)
	
	Набор = РегистрыСведений.СтатусыПубликацииТоваровЯндексМаркет.СоздатьНаборЗаписей();
	Набор.Отбор.Номенклатура.Установить(ВыбраннаяСтрока.Номенклатура);
	Набор.Отбор.Характеристика.Установить(ВыбраннаяСтрока.Характеристика);
	Набор.Отбор.Упаковка.Установить(ВыбраннаяСтрока.Упаковка);
	Набор.Прочитать();
	Если Набор.Количество() Тогда
		Запись = Набор[0];
		Запись.Выбран = НЕ Запись.Выбран; 
		Набор.Записать();
	КонецЕсли;
			
КонецПроцедуры

&НаКлиенте
Процедура УтверждениеАссортиментаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущийЭлемент.Имя = "УтверждениеАссортиментаВыбран" Тогда
		СтандартнаяОбработка = Ложь;
		ЗаписатьИзменениеФлагаВыбран(ВыбраннаяСтрока);
		Элементы.УтверждениеАссортимента.Обновить();
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "УтверждениеАссортиментаЕстьИдентификаторПлощадки" Тогда
		СтандартнаяОбработка = Ложь;
		Если Элемент.ТекущиеДанные.ЕстьИдентификаторПлощадки Тогда
			ПерейтиПоНавигационнойСсылке("https://pokupki.market.yandex.ru/product/"+СокрЛП(СтрЗаменить(Элемент.ТекущиеДанные.ИдентификаторТовараПлощадки,Символ(160),"")));
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьФлагиНаСервере(МассивСтрок, ЗначениеФлага)
	
	Для каждого ВыбраннаяСтрока Из МассивСтрок Цикл
		
		Набор = РегистрыСведений.СтатусыПубликацииТоваровЯндексМаркет.СоздатьНаборЗаписей();
		Набор.Отбор.Номенклатура.Установить(ВыбраннаяСтрока.Номенклатура);
		Набор.Отбор.Характеристика.Установить(ВыбраннаяСтрока.Характеристика);
		Набор.Отбор.Упаковка.Установить(ВыбраннаяСтрока.Упаковка);
		
		Набор.Прочитать();
		Если Набор.Количество() Тогда
			Запись = Набор[0];
			Запись.Выбран = ЗначениеФлага; 
			Набор.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	ВыделенныеСтроки = Элементы.УтверждениеАссортимента.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество()<1 Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выделите все строки, для которых надо установить флаги.'"));
	Иначе
	    ИзменитьФлагиНаСервере(ВыделенныеСтроки, Истина);
		Элементы.УтверждениеАссортимента.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьВсе(Команда)
	
	ВыделенныеСтроки = Элементы.УтверждениеАссортимента.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество()<1 Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выделите все строки, для которых надо снять флаги.'"));
	Иначе
	    ИзменитьФлагиНаСервере(ВыделенныеСтроки, Ложь);
		Элементы.УтверждениеАссортимента.Обновить();
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УтвердитьОтклонитьВыбранныеНаСервере(ПоложительноеРешение)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыПубликацииТоваровЯндексМаркет.Номенклатура КАК Номенклатура,
	               |	СтатусыПубликацииТоваровЯндексМаркет.Характеристика КАК Характеристика,
	               |	СтатусыПубликацииТоваровЯндексМаркет.Упаковка КАК Упаковка
	               |ИЗ
	               |	РегистрСведений.СтатусыПубликацииТоваровЯндексМаркет КАК СтатусыПубликацииТоваровЯндексМаркет
	               |ГДЕ
	               |	СтатусыПубликацииТоваровЯндексМаркет.Выбран
	               |	И СтатусыПубликацииТоваровЯндексМаркет.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВыгрузкиТоваровЯндексМаркет.ПолученаРекомендация)";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл 
		Набор = РегистрыСведений.СтатусыПубликацииТоваровЯндексМаркет.СоздатьНаборЗаписей();
		Набор.Отбор.Номенклатура.Установить(Результат.Номенклатура);
		Набор.Отбор.Характеристика.Установить(Результат.Характеристика);
		Набор.Отбор.Упаковка.Установить(Результат.Упаковка);
		Набор.Прочитать();
		Если Набор.Количество() Тогда
			Запись = Набор[0];
			Если ПоложительноеРешение Тогда
				Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.УтвержденаРекомендация;
			Иначе
				Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.НевернаяРекомендация;
				Запись.ОписаниеОшибки = "Если товар определен неправильно: 
					|Проверьте, что товар относится к одной из категорий, представленных на Маркете.
					|Убедитесь, что вы предоставили наиболее полные и точные данные о товаре. 
					|Если вы не указали какую-либо информацию, уточните входные данные запроса (например, добавьте цвет или размер в характеристики товара или добавьте описание модели, скорректировав данные в поле ""Представление"" на закладке ""Данные о товаре"", укажите базовую цену товара, если она не заполнена).
					|После заполненения данных отправьте повторно публикацию на получение рекомендации (кнопка ""Получить рекомендацию""). 
					|Попробуйте найти товар в поиске по разделу «Покупки» на Маркете. Если товар найдется, SKU на Яндексе можно взять из URL его страницы. Например, если URL страницы товара — https://pokupki.market.yandex.ru/product/7715752, то его SKU на Яндексе — 7715752.Если советы не помогли - отправьте информацию о товаре без SKU на Яндексе (кнопка ""Отправить на модерацию"") - сотрудники Маркета могут подобрать или создать карточки для ваших товаров в личном кабинете, если товар еще не продается на Маркете.";				
			КонецЕсли;
			Запись.Выбран = Ложь;
			Набор.Записать();
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура УтвердитьВыбранные(Команда)
	
	УтвердитьОтклонитьВыбранныеНаСервере(Истина);
	Элементы.УтверждениеАссортимента.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьВыбранные(Команда)
	
	УтвердитьОтклонитьВыбранныеНаСервере(Ложь);
	Элементы.УтверждениеАссортимента.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура АссортиментВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
	Если Элемент.ТекущийЭлемент.Имя = "АссортиментЕстьИдентификаторПлощадки" Тогда
		СтандартнаяОбработка = Ложь;
		Если Элемент.ТекущиеДанные.ЕстьИдентификаторПлощадки Тогда
			ПерейтиПоНавигационнойСсылке("https://pokupki.market.yandex.ru/product/"+СокрЛП(СтрЗаменить(Элемент.ТекущиеДанные.ИдентификаторТовараПлощадки,Символ(160),"")));
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправлениеОшибокВыбратьВыделенные(Команда)
	
	ВыделенныеСтроки = Элементы.ИсправлениеОшибок.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество()<1 Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выделите все строки, для которых надо установить флаги.'"));
	Иначе
	    ИзменитьФлагиНаСервере(ВыделенныеСтроки, Истина);
		Элементы.ИсправлениеОшибок.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправлениеОшибокСброситьВыделенные(Команда)
	
	ВыделенныеСтроки = Элементы.ИсправлениеОшибок.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество()<1 Тогда
		ОчиститьСообщения();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выделите все строки, для которых надо снять флаги.'"));
	Иначе
	    ИзменитьФлагиНаСервере(ВыделенныеСтроки, Ложь);
		Элементы.ИсправлениеОшибок.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсправлениеОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущийЭлемент.Имя = "ИсправлениеОшибокВыбран" Тогда
		СтандартнаяОбработка = Ложь;
		ЗаписатьИзменениеФлагаВыбран(ВыбраннаяСтрока);
		Элементы.ИсправлениеОшибок.Обновить();
	ИначеЕсли Элемент.ТекущийЭлемент.Имя = "ИсправлениеОшибокЕстьИдентификаторПлощадки" Тогда
		СтандартнаяОбработка = Ложь;
		Если Элемент.ТекущиеДанные.ЕстьИдентификаторПлощадки Тогда
			ПерейтиПоНавигационнойСсылке("https://pokupki.market.yandex.ru/product/"+СокрЛП(СтрЗаменить(Элемент.ТекущиеДанные.ИдентификаторТовараПлощадки,Символ(160),"")));
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтправитьНаПовторноеПолучениеРекомендации(Команда)
	
	ПовторноОтправитьЗапросВыбранныеНаСервере("НаПолучениеРекомендации");
	Элементы.ИсправлениеОшибок.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПовторноНаМодерацию(Команда)
	
	ПовторноОтправитьЗапросВыбранныеНаСервере("НаМодерацию");
	Элементы.ИсправлениеОшибок.Обновить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПовторноОтправитьЗапросВыбранныеНаСервере(Действие)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыПубликацииТоваровЯндексМаркет.ИдентификаторПубликации КАК ИдентификаторПубликации,
	               |	СтатусыПубликацииТоваровЯндексМаркет.Номенклатура КАК Номенклатура,
	               |	СтатусыПубликацииТоваровЯндексМаркет.Характеристика КАК Характеристика,
	               |	СтатусыПубликацииТоваровЯндексМаркет.Упаковка КАК Упаковка
	               |ИЗ
	               |	РегистрСведений.СтатусыПубликацииТоваровЯндексМаркет КАК СтатусыПубликацииТоваровЯндексМаркет
	               |ГДЕ
	               |	СтатусыПубликацииТоваровЯндексМаркет.Выбран
	               |	И СтатусыПубликацииТоваровЯндексМаркет.Статус В(&МассивОшибочныхСтатусов)";
	
	МассивОшибочныхСтатусов = Новый Массив;
	МассивОшибочныхСтатусов.Добавить(Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.ОшибкаПриОтправкеНаМодерацию);
	МассивОшибочныхСтатусов.Добавить(Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.ОшибкаПриПолученииРекомендации);
	//модерация не пройдена - обработать отдельно
	МассивОшибочныхСтатусов.Добавить(Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.МодерацияНеПройдена);
	МассивОшибочныхСтатусов.Добавить(Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.НевернаяРекомендация);
	МассивОшибочныхСтатусов.Добавить(Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.РекомендацияНеНайдена);
	
	Запрос.Параметры.Вставить("МассивОшибочныхСтатусов",МассивОшибочныхСтатусов);
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл 
		Набор = РегистрыСведений.СтатусыПубликацииТоваровЯндексМаркет.СоздатьНаборЗаписей();
		Набор.Отбор.Номенклатура.Установить(Результат.Номенклатура);
		Набор.Отбор.Характеристика.Установить(Результат.Характеристика);
		Набор.Отбор.Упаковка.Установить(Результат.Упаковка);
		Набор.Прочитать();
		Если Набор.Количество() Тогда
			Запись = Набор[0];
			Если Действие = "НаПолучениеРекомендации" Тогда
				Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.Новый;
			ИначеЕсли Действие = "НаМодерацию" Тогда
				Если ЗначениеЗаполнено(Запись.ИдентификаторТовараПлощадки) Тогда
					Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.УтвержденаРекомендация;
				Иначе
					Запись.Статус = Перечисления.СтатусыВыгрузкиТоваровЯндексМаркет.СозданиеНового;
				КонецЕсли;
			КонецЕсли;
			Запись.Выбран = Ложь;
			Набор.Записать();
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФормуНастроек(Команда)
	
	ОткрытьФорму(
	"Обработка.ЯндексМаркетВитринаФулфилмент.Форма.НастройкиОбменаДанными",,,Истина,,, Новый ОписаниеОповещения("НастроитьОбменДаннымиЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
КонецПроцедуры   

&НаКлиенте
Процедура НастроитьОбменДаннымиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ЗаполнитьДанныеПоУчетнойЗаписи();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не ЗначениеЗаполнено(ВидЦен) ИЛИ Не ЗначениеЗаполнено(ИсточникКатегории) Тогда
		
		ОткрытьФорму(
		"Обработка.ЯндексМаркетВитринаФулфилмент.Форма.НастройкиОбменаДанными",,,Истина);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьПоДаннымПрайсЛистаНаСервере()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|ЦеныНоменклатуры.Номенклатура КАК Номенклатура,
	|ЦеныНоменклатуры.Характеристика КАК Характеристика,
	|ЦеныНоменклатуры.Упаковка КАК Упаковка,
	|ЦеныНоменклатуры.Цена КАК Цена
	|ИЗ
	|РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата, ВидЦены = &БазовыйПрайсЛист) КАК ЦеныНоменклатуры
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.СтатусыПубликацииТоваровЯндексМаркет КАК СтатусыПубликацииТоваровЯндексМаркет
	|	ПО (ЦеныНоменклатуры.Номенклатура = СтатусыПубликацииТоваровЯндексМаркет.Номенклатура) И 
	|	(ЦеныНоменклатуры.Характеристика = СтатусыПубликацииТоваровЯндексМаркет.Характеристика) 
	//|	(ЦеныНоменклатуры.Упаковка = ИдентификаторыПубликацийТоваровЯндексМаркет.Упаковка)";
	|ГДЕ
	|СтатусыПубликацииТоваровЯндексМаркет.Номенклатура IS NULL";	
	Запрос.Параметры.Вставить("ТекущаяДата",ТекущаяДата());
	Запрос.Параметры.Вставить("БазовыйПрайсЛист",ВидЦен);	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		
		Набор = РегистрыСведений.СтатусыПубликацииТоваровЯндексМаркет.СоздатьНаборЗаписей(); 
		Набор.Отбор.Номенклатура.Установить(Результат.Номенклатура);
		Набор.Отбор.Характеристика.Установить(Результат.Характеристика);
		//Набор.Отбор.Упаковка.Установить(Результат.Упаковка);
		Набор.Прочитать();
		Если Набор.Количество() Тогда
			Запись = Набор[0];
			Запись.ЦенаПродажи = Результат.Цена;
		Иначе 
			Запись = Набор.Добавить(); 
			Запись.Номенклатура = Результат.Номенклатура; 
			Запись.Характеристика = Результат.Характеристика; 
			Запись.Упаковка = Результат.Номенклатура.ЕдиницаИзмерения; 
			Запись.ЦенаПродажи = Результат.Цена;
		КонецЕсли; 
		Набор.Записать();    
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПоДаннымПрайсЛиста(Команда)
	
	ОбновитьПоДаннымПрайсЛистаНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтобратьПоМаркеруНовыеНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СтатусыПубликацииТоваровЯндексМаркет,
	"МаркерСтатуса",
	2,
	ВидСравненияКомпоновкиДанных.Равно);

	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьПоМаркеруНовые(Команда)
	
	ОтобратьПоМаркеруНовыеНаСервере();   
	Элементы.ОтборПоМаркерам.Картинка = БиблиотекаКартинок.СерыйШарБЭД;
	Элементы.Ассортимент.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОтобратьПоМаркеруВПроцессеНаСервере()

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СтатусыПубликацииТоваровЯндексМаркет,
	"МаркерСтатуса",
	1,
	ВидСравненияКомпоновкиДанных.Равно);

	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьПоМаркеруВПроцессе(Команда)
	
	ОтобратьПоМаркеруВПроцессеНаСервере();
	Элементы.ОтборПоМаркерам.Картинка = БиблиотекаКартинок.ЖелтыйШарБЭД;
	Элементы.Ассортимент.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОтобратьПоМаркеруОшибкаНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СтатусыПубликацииТоваровЯндексМаркет,
	"МаркерСтатуса",
	0,
	ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьПоМаркеруОшибка(Команда)
	
	ОтобратьПоМаркеруОшибкаНаСервере(); 
	Элементы.ОтборПоМаркерам.Картинка = БиблиотекаКартинок.КрасныйШарБЭД;
	Элементы.Ассортимент.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ОтобратьПоМаркеруГотовыНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СтатусыПубликацииТоваровЯндексМаркет,
	"МаркерСтатуса",
	3,
	ВидСравненияКомпоновкиДанных.Равно);

	
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьПоМаркеруГотовы(Команда)
	
	ОтобратьПоМаркеруГотовыНаСервере();  
	Элементы.ОтборПоМаркерам.Картинка = БиблиотекаКартинок.ЗеленыйШарБЭД;
	Элементы.Ассортимент.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсе(Команда)
	
	ПоказатьВсеНаСервере();    
	Элементы.ОтборПоМаркерам.Картинка = БиблиотекаКартинок.Состояние0Процентов;
	Элементы.Ассортимент.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьВсеНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СтатусыПубликацииТоваровЯндексМаркет,
	"МаркерСтатуса");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНоменклатуруПоОтбору(Команда)
	
	ОткрытьФорму(
	"Обработка.ЯндексМаркетВитринаФулфилмент.Форма.ОтборНоменклатуры",,ЭтаФорма,Истина);
	
КонецПроцедуры 

&НаСервере
Процедура ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров   = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресТоваровВХранилище);
	//ТаблицаДокумента = ?(Отгрузка, Объект.Продукция, Объект.Материалы);
	
	СписокСвойств    = "Номенклатура, Характеристика, Упаковка";   
	
	ИспользоватьУпаковкиНоменклатуры       = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
	ИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
		
	// Загрузка сформированного списка товаров.
	Для Каждого СтрокаТЧ Из ТаблицаТоваров Цикл
		Набор = РегистрыСведений.СтатусыПубликацииТоваровЯндексМаркет.СоздатьНаборЗаписей();
		Набор.Отбор.Номенклатура.Установить(СтрокаТЧ.Номенклатура);		
		Если ИспользоватьХарактеристикиНоменклатуры Тогда
			Набор.Отбор.Характеристика.Установить(СтрокаТЧ.Характеристика);
		КонецЕсли;
		
		Набор.Прочитать();
		Если НЕ Набор.Количество() Тогда 
			Запись = Набор.Добавить(); 
			
			Запись.Номенклатура = СтрокаТЧ.Номенклатура;
			
			Если ИспользоватьХарактеристикиНоменклатуры Тогда
				Запись.Характеристика = СтрокаТЧ.Характеристика;
			КонецЕсли;
			
			Если ИспользоватьУпаковкиНоменклатуры Тогда
				Запись.Упаковка = СтрокаТЧ.Номенклатура.ЕдиницаИзмерения;
			КонецЕсли;		
			Набор.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура УстановитьНастройки(АдресВоВременномХранилище)
	
		Если АдресВоВременномХранилище <> Неопределено Тогда
			
			СтруктураДанных = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище); // см. УстановкаЦенКлиентСервер.НоваяСтруктураНастроекФормы
			
			КомпоновщикНастроекОтбор.ЗагрузитьНастройки(СтруктураДанных.НастройкиКомпоновщика);
			
			ВариантНавигации = СтруктураДанных.ВариантНавигации;
			ВидНоменклатуры = СтруктураДанных.ВидНоменклатуры;
			ВариантНеобходимостиУстановкиЦены = СтруктураДанных.ВариантНеобходимостиУстановкиЦены; 
			
			УстановленыНастройкиОтбора = КомпоновщикНастроекОтбор.Настройки.Отбор.Элементы.Количество() > 0;
			
			
			ИспользоватьЦеновыеГруппы              = ПолучитьФункциональнуюОпцию("ИспользоватьЦеновыеГруппы");
			ИспользоватьУпаковкиНоменклатуры       = ПолучитьФункциональнуюОпцию("ИспользоватьУпаковкиНоменклатуры");
			ИспользоватьНесколькоВидовЦен          = ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВидовЦен");
			ИспользуетсяЦенообразование25          = ЦенообразованиеВызовСервера.ИспользуетсяЦенообразование25(ТекущаяДата());
			
			ИспользоватьХарактеристикиНоменклатуры = ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристикиНоменклатуры");
			ИспользоватьСерииНоменклатуры          = ПолучитьФункциональнуюОпцию("ИспользоватьСерииНоменклатуры");
			
			СтруктураНастроек = Новый Структура;
			СтруктураНастроек.Вставить("ОбязательныеПоля"   , Новый Массив);
			СтруктураНастроек.Вставить("ПараметрыДанных"    , Новый Структура);
			СтруктураНастроек.Вставить("КомпоновщикНастроек", Неопределено);
			СтруктураНастроек.Вставить("ИмяМакетаСхемыКомпоновкиДанных" , Неопределено);
			СтруктураНастроек.Вставить("ВестиУчетСертификатовНоменклатуры" , Ложь);
			СтруктураНастроек.Вставить("ЦеныНаДату", КонецДня(ТекущаяДата()));
			
			СтруктураНастроек.ОбязательныеПоля.Добавить("Номенклатура");
			Если ИспользуетсяЦенообразование25 Тогда
				Если ИспользоватьХарактеристикиНоменклатуры Тогда
					СтруктураНастроек.ОбязательныеПоля.Добавить("Характеристика");
					СтруктураНастроек.ОбязательныеПоля.Добавить("ХарактеристикаЦО");
				КонецЕсли;
				Если ИспользоватьСерииНоменклатуры Тогда
					СтруктураНастроек.ОбязательныеПоля.Добавить("Серия");
					СтруктураНастроек.ОбязательныеПоля.Добавить("СерияЦО");
				КонецЕсли;
				Если ИспользоватьУпаковкиНоменклатуры Тогда
					СтруктураНастроек.ОбязательныеПоля.Добавить("УпаковкаЦО");
				КонецЕсли;
			Иначе	
				Если ИспользоватьХарактеристикиНоменклатуры Тогда
					СтруктураНастроек.ОбязательныеПоля.Добавить("Характеристика");
				КонецЕсли;
			КонецЕсли;
		
			СтруктураНастроек.КомпоновщикНастроек = Новый Структура("Настройки"	, КомпоновщикНастроекОтбор.Настройки);
			Если ИспользуетсяЦенообразование25 Тогда
				СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "Макет2_5";
			Иначе	
				СтруктураНастроек.ИмяМакетаСхемыКомпоновкиДанных = "Макет";
			КонецЕсли;
				
			// Загрузка сформированного списка товаров.
			СтруктураРезультата = Обработки.ПодборТоваровПоОтбору.ПодготовитьСтруктуруДанных(СтруктураНастроек);
			Для Каждого СтрокаТЧ Из СтруктураРезультата.ТаблицаТоваров Цикл
				//Попытка	
					Набор = РегистрыСведений.СтатусыПубликацииТоваровЯндексМаркет.СоздатьНаборЗаписей();
					Набор.Отбор.Номенклатура.Установить(СтрокаТЧ.Номенклатура);		
					Если ИспользоватьХарактеристикиНоменклатуры Тогда
						Набор.Отбор.Характеристика.Установить(СтрокаТЧ.Характеристика);
					КонецЕсли;
					
					//Если ИспользоватьУпаковкиНоменклатуры Тогда
					//	Набор.Отбор.Упаковка.Установить(СтрокаТЧ.Упаковка);
					//КонецЕсли;
					Набор.Прочитать();
					Если НЕ Набор.Количество() Тогда 
						Запись = Набор.Добавить(); 
						
						Запись.Номенклатура = СтрокаТЧ.Номенклатура;
						
						Если ИспользоватьХарактеристикиНоменклатуры Тогда
							Запись.Характеристика = СтрокаТЧ.Характеристика;
						КонецЕсли;
						
						Если ИспользоватьУпаковкиНоменклатуры Тогда
							Запись.Упаковка = СтрокаТЧ.Номенклатура.ЕдиницаИзмерения;
						КонецЕсли;
						
						Набор.Записать();
					КонецЕсли;
				//Исключение
				//КонецПопытки
				
				//НоваяСтрока = ТаблицаНоменклатуры.Добавить();
				//НоваяСтрока.Номенклатура = СтрокаТЧ.Номенклатура;
				//
				//Если СтруктураФормы.ИспользуетсяЦенообразование25 Тогда
				//	Если СтруктураФормы.ИспользоватьХарактеристикиНоменклатуры Тогда
				//		НоваяСтрока.ХарактеристикаЦО = СтрокаТЧ.ХарактеристикаЦО;
				//	КонецЕсли;
				//	
				//	Если СтруктураФормы.ИспользоватьСерииНоменклатуры Тогда
				//		НоваяСтрока.СерияЦО = СтрокаТЧ.СерияЦО;
				//	КонецЕсли;
				//	
				//	Если СтруктураФормы.ИспользоватьУпаковкиНоменклатуры Тогда
				//		НоваяСтрока.УпаковкаЦО = СтрокаТЧ.УпаковкаЦО;
				//	КонецЕсли;
				//Иначе	 
				//	Если СтруктураФормы.ИспользоватьХарактеристикиНоменклатуры Тогда
				//		НоваяСтрока.Характеристика   = СтрокаТЧ.Характеристика;
				//	КонецЕсли;
				//КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Обработка.ЯндексМаркетВитринаФулфилмент.Форма.ОтборНоменклатуры" Тогда
		
		УстановитьНастройки(ВыбранноеЗначение); 
		
	ИначеЕсли ИсточникВыбора.ИмяФормы = "Обработка.ЯндексМаркетВитринаФулфилмент.Форма.ПодборНоменклатуры" Тогда
		
		ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
	КонецЕсли;
	
	Элементы.Ассортимент.Обновить();
	
КонецПроцедуры

&НаСервере
Функция  ТекущиеДанныеАвторизацииОрганизация()
	
	УстановитьПривилегированныйРежим(Истина);
	Организация = ИнтеграцияСЯндексМаркетСервер.ТекущиеДанныеАвторизацииОрганизация();	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьПодбор(Команда)
		
	Отказ = Ложь;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрЗаголовок = НСтр("ru = 'Подбор товаров в %Объект%'");
	ПараметрЗаголовок = СтрЗаменить(ПараметрЗаголовок, "%Объект%", НСтр("ru='ассортимент на Яндекс.Маркет'"));
	
	Организация = ТекущиеДанныеАвторизацииОрганизация();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация",              Организация);  
	ПараметрыФормы.Вставить("Заголовок",              	ПараметрЗаголовок);
	ПараметрыФормы.Вставить("ПодборВариантовОбеспечения",              Ложь);
	ПараметрыФормы.Вставить("ПодборВАссортиментЯндексМаркет",          Истина);
	ПараметрыФормы.Вставить("РежимПодбораБезСуммовыхПараметров",       Истина);
	ПараметрыФормы.Вставить("БезОтбораПоИспользоватьПриПродажеВЦену",  Истина);
	
	ОткрытьФорму("Обработка.ЯндексМаркетВитринаФулфилмент.Форма.ПодборНоменклатуры", ПараметрыФормы, ЭтаФорма, УникальныйИдентификатор);
		
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрАктуальныхЦен(Команда)
	
	ПриАктивацииГиперСсылкиНаПанели("КнопкаПросмотрАктуальныхЦен");
	Элементы.АктуальныеЦены.Обновить(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрайсЛист(Команда)  
	
	ОткрытьФорму(
	"Обработка.ПрайсЛист.Форма.Форма",
	,,Истина);

КонецПроцедуры

&НаСервере
Функция СоответствиеИменКолонок()
	
	СоответствиеИменКолонок = Новый Соответствие();
	СоответствиеИменКолонок.Вставить("Минимальная цена продажи на Маркете","АктуальныеЦеныМинимальнаяЦенаПродажи");
	СоответствиеИменКолонок.Вставить("Рекомендованная Маркетом","АктуальныеЦеныРекомендованнаяЦена");
	СоответствиеИменКолонок.Вставить("Минимальная среди всех предложений товара на Маркете","АктуальныеЦеныМинимальнаяСредиВсехПредложений");
	СоответствиеИменКолонок.Вставить("Максимальная без скидки","АктуальныеЦеныМаксимальнаяБезСкидки");
	СоответствиеИменКолонок.Вставить("Максимальная для показов на Маркете","АктуальныеЦеныМаксимальнаяДляПоказов");
	
	Возврат СоответствиеИменКолонок; 

КонецФункции  


&НаСервере
Функция ТаблицаЦен() 
	
	МассивРекомендованныхЦен = ИнтеграцияСЯндексМаркетСервер.ПолучитьМассивРекомендованныхЦен(); 
	ТаблицаЦен = Новый ТаблицаЗначений();
	ТаблицаЦен.Колонки.Добавить("ВидЦены",Новый ОписаниеТипов("СправочникСсылка.ВидыЦен")); 
	КвалификаторСтроки = Новый КвалификаторыСтроки(250,ДопустимаяДлина.Фиксированная);
	ТаблицаЦен.Колонки.Добавить("ПолеТаблицы",Новый ОписаниеТипов("Строка",,,КвалификаторСтроки));
	
	Для каждого ЭлементМассива Из МассивРекомендованныхЦен Цикл 
		ЗначениеИзХранилища = ЭлементМассива.ХранилищеНастроекПараметровСпособаЗаданияЦены.Получить();
		ИмяКолонки = СоответствиеИменКолонок().Получить(ЗначениеИзХранилища.ЗначениеПараметра); 
		Если ИмяКолонки <> Неопределено Тогда
			Элементы.АктуальныеЦены.ПодчиненныеЭлементы[ИмяКолонки].Видимость = Истина; 
			Cтр = ТаблицаЦен.Добавить();
			Cтр.ВидЦены = ЭлементМассива;
			Cтр.ПолеТаблицы = СтрЗаменить(ИмяКолонки,"АктуальныеЦены",""); 
		КонецЕсли;
	КонецЦикла; 
	
	Возврат ТаблицаЦен; 
	
КонецФункции

&НаСервере
Процедура ОбновитьТаблицуЦенНаСервере() 
	
	АктуальныеЦены.Очистить();
	ТаблицаЦен = ТаблицаЦен();
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("ТаблицаЦен",ТаблицаЦен);
	Запрос.Параметры.Вставить("ВидЦен",ВидЦен);
	Запрос.Текст = "ВЫБРАТЬ
	|  ТаблицаЦен.ВидЦены КАК ВидЦены,
	|  ТаблицаЦен.ПолеТаблицы КАК ПолеТаблицы	 
	|ПОМЕСТИТЬ ВнутренняяТаблицаЦен
	|ИЗ
	|  &ТаблицаЦен КАК ТаблицаЦен
	|;
	|	ВЫБРАТЬ
	|		АктуальныеЦены.ПредставлениеТовара КАК ПредставлениеТовара, 
	|		АктуальныеЦены.ДатаОбновления КАК ДатаОбновления,
	|		МАКСИМУМ(АктуальныеЦены.ЦенаПродажи) КАК ЦенаПродажи,
	|		МАКСИМУМ(АктуальныеЦены.МинимальнаяЦенаПродажи) КАК МинимальнаяЦенаПродажи,
	|		МАКСИМУМ(АктуальныеЦены.РекомендованнаяЦена) КАК РекомендованнаяЦена, 
	|		МАКСИМУМ(АктуальныеЦены.МинимальнаяСредиВсехПредложений) КАК МинимальнаяСредиВсехПредложений,
	|		МАКСИМУМ(АктуальныеЦены.МаксимальнаяБезСкидки) КАК МаксимальнаяБезСкидки,
	|		МАКСИМУМ(АктуальныеЦены.МаксимальнаяДляПоказов) КАК МаксимальнаяДляПоказов
	|	ИЗ
   	|	
	|	(ВЫБРАТЬ
	|		СтатусыПубликацииТоваровЯндексМаркет.ПредставлениеТовара КАК ПредставлениеТовара, 
	|		СтатусыПубликацииТоваровЯндексМаркет.ДатаУстановкиЦены КАК ДатаОбновления,
	|		ВЫБОР КОГДА ЦеныНоменклатуры25СрезПоследних.ВидЦены = &ВидЦен ТОГДА ЦеныНоменклатуры25СрезПоследних.Цена ИНАЧЕ 0 КОНЕЦ КАК ЦенаПродажи,
	|		ВЫБОР КОГДА ВнутренняяТаблицаЦен.ПолеТаблицы = ""МинимальнаяЦенаПродажи"" ТОГДА ЦеныНоменклатуры25СрезПоследних.Цена ИНАЧЕ 0 КОНЕЦ КАК МинимальнаяЦенаПродажи, 
	|		ВЫБОР КОГДА ВнутренняяТаблицаЦен.ПолеТаблицы = ""РекомендованнаяЦена"" ТОГДА ЦеныНоменклатуры25СрезПоследних.Цена ИНАЧЕ 0 КОНЕЦ КАК РекомендованнаяЦена,
	|		ВЫБОР КОГДА ВнутренняяТаблицаЦен.ПолеТаблицы = ""МинимальнаяСредиВсехПредложений"" ТОГДА ЦеныНоменклатуры25СрезПоследних.Цена ИНАЧЕ 0 КОНЕЦ КАК МинимальнаяСредиВсехПредложений,
	|		ВЫБОР КОГДА ВнутренняяТаблицаЦен.ПолеТаблицы = ""МаксимальнаяБезСкидки"" ТОГДА ЦеныНоменклатуры25СрезПоследних.Цена ИНАЧЕ 0 КОНЕЦ КАК МаксимальнаяБезСкидки,
	|		ВЫБОР КОГДА ВнутренняяТаблицаЦен.ПолеТаблицы = ""МаксимальнаяДляПоказов"" ТОГДА ЦеныНоменклатуры25СрезПоследних.Цена ИНАЧЕ 0 КОНЕЦ КАК МаксимальнаяДляПоказов
	|	ИЗ
	|		РегистрСведений.СтатусыПубликацииТоваровЯндексМаркет КАК СтатусыПубликацииТоваровЯндексМаркет
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры25.СрезПоследних КАК ЦеныНоменклатуры25СрезПоследних
	|			ПО СтатусыПубликацииТоваровЯндексМаркет.Номенклатура = ЦеныНоменклатуры25СрезПоследних.Номенклатура
	|				ЛЕВОЕ СОЕДИНЕНИЕ ВнутренняяТаблицаЦен ПО ЦеныНоменклатуры25СрезПоследних.ВидЦены = ВнутренняяТаблицаЦен.ВидЦены
	|	ГДЕ
	|		СтатусыПубликацииТоваровЯндексМаркет.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВыгрузкиТоваровЯндексМаркет.МодерацияПройдена)
	|		И ЦеныНоменклатуры25СрезПоследних.Номенклатура ЕСТЬ НЕ NULL
	|		И ( 
	|		ЦеныНоменклатуры25СрезПоследних.ВидЦены.СпособЗаданияЦены = ЗНАЧЕНИЕ(Перечисление.СпособыЗаданияЦен.ЗагружаетсяИзЯндексМаркет)
	|		ИЛИ ЦеныНоменклатуры25СрезПоследних.ВидЦены = &ВидЦен
	|		)) КАК АктуальныеЦены
	|	СГРУППИРОВАТЬ ПО 
	|		АктуальныеЦены.ПредставлениеТовара,
	|		АктуальныеЦены.ДатаОбновления";
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл  
		СтрНов = АктуальныеЦены.Добавить();
		ЗаполнитьЗначенияСвойств(СтрНов,Результат);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицуЦен(Команда)
	ОбновитьТаблицуЦенНаСервере();
КонецПроцедуры    

&НаСервере
Функция ВыборЗагружаемыхВидовЦенНаСервере()
	  	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;   
	
	ВидыЦен = ИнтеграцияСЯндексМаркетСервер.ПолучитьМассивРекомендованныхЦен(); 
	ТаблицаВидовЦен = Новый ТаблицаЗначений();
	ТаблицаВидовЦен.Колонки.Добавить("ВидЦены", Новый ОписаниеТипов("СправочникСсылка.ВидыЦен"));
	Для Каждого Элемент Из ВидыЦен Цикл
		СтрокаТаблицы = ТаблицаВидовЦен.Добавить();
		СтрокаТаблицы.ВидЦены 		= Элемент;
	КонецЦикла;	   
	
	ПараметрыЗадания = Новый Структура();
	ПараметрыЗадания.Вставить("НемедленноеОбновление",Истина);
	ПараметрыЗадания.Вставить("ТаблицаВидовЦен",ТаблицаВидовЦен);
	
	ИмяРегламентногоЗадания = "ИнтеграцияСЯндексМаркетСервер.ЗагрузитьРекомендованныеЦеныЯндексМаркет";
	
	РезультатРасчетаДлительнойОперации = ДлительныеОперации.ВыполнитьВФоне(ИмяРегламентногоЗадания,
	ПараметрыЗадания,
	ПараметрыВыполнения);
	
	Возврат РезультатРасчетаДлительнойОперации;
КонецФункции 

&НаКлиенте
Процедура ОткрытьОкноОжиданияЗагрузкиРекомендованныхЦенВФоне(Знач ИмяПроцедуры, ДопПараметр)
	
	Если ЗначениеЗаполнено(ИдентификаторЗадания) Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания  = Истина;
		ПараметрыОжидания.ВыводитьСообщения     = Истина;    
		Если ДопПараметр = "Загрузка" Тогда
			ПараметрыОжидания.ТекстСообщения     	= НСтр("ru='Идет загрузка рекомендуемых цен'");  
		ИначеЕсли ДопПараметр = "Выгрузка" Тогда
			ПараметрыОжидания.ТекстСообщения     	= НСтр("ru='Идет выгрузка установленных цен'");
		ИначеЕсли ДопПараметр = "ВыгрузкаОстатков" Тогда
			ПараметрыОжидания.ТекстСообщения     	= НСтр("ru='Идет выгрузка остатков товаров'");
		КонецЕсли;
		ОповещениеОЗавершении = Новый ОписаниеОповещения(ИмяПроцедуры, ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатРасчетаДлительнойОперации, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры 


&НаКлиенте
Процедура ЗавершитьДлительнуюОперациюНаКлиентеОбщая(ФоновоеЗадание, ДополнительныеПараметры = Неопределено) Экспорт
	
	РезультатРасчетаДлительнойОперации = ФоновоеЗадание;
	
	Если НЕ РезультатРасчетаДлительнойОперации = Неопределено Тогда
		Если РезультатРасчетаДлительнойОперации.Статус = "Выполнено" Тогда
			
			ОбновитьТаблицуЦенНаСервере();
	
		ИначеЕсли РезультатРасчетаДлительнойОперации.Статус = "Ошибка" Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатРасчетаДлительнойОперации.КраткоеПредставлениеОшибки);
		КонецЕсли;
	КонецЕсли;
	
	РезультатРасчетаДлительнойОперации 	= Неопределено;	
	ИдентификаторЗадания				= Неопределено;

КонецПроцедуры    

&НаКлиенте
Процедура ЗагрузитьРекомендованныеЦены(Команда)

	ОчиститьСообщения();  
	
	РезультатРасчетаДлительнойОперации = ВыборЗагружаемыхВидовЦенНаСервере();
	
	ИдентификаторЗадания = РезультатРасчетаДлительнойОперации.ИдентификаторЗадания;
	
	Если РезультатРасчетаДлительнойОперации.Статус = "Выполнено" Тогда
		
		ЗавершитьДлительнуюОперациюНаКлиентеОбщая(РезультатРасчетаДлительнойОперации);
		
	Иначе	
		
		ОткрытьОкноОжиданияЗагрузкиРекомендованныхЦенВФоне("ЗавершитьДлительнуюОперациюНаКлиентеОбщая", "Загрузка")
		
	КонецЕсли;
	
КонецПроцедуры     

&НаСервере
Функция ВыгрузитьУстановленныеЦеныНаСервереВФоне()
	  	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;   
	
	ПараметрыЗадания = Новый Структура();
	ПараметрыЗадания.Вставить("НемедленноеОбновление",Истина);
		
	ИмяРегламентногоЗадания = "ИнтеграцияСЯндексМаркетСервер.ВыгрузкаУстановленныхЦенВСервисЯндексМаркет";
	
	РезультатРасчетаДлительнойОперации = ДлительныеОперации.ВыполнитьВФоне(ИмяРегламентногоЗадания,
	ПараметрыЗадания,
	ПараметрыВыполнения);
	
	Возврат РезультатРасчетаДлительнойОперации;
КонецФункции   

&НаКлиенте
Процедура ВыгрузитьУстановленныеЦены(Команда) 
	
	ОчиститьСообщения();  
	
	РезультатРасчетаДлительнойОперации = ВыгрузитьУстановленныеЦеныНаСервереВФоне();
	
	ИдентификаторЗадания = РезультатРасчетаДлительнойОперации.ИдентификаторЗадания;
	
	Если РезультатРасчетаДлительнойОперации.Статус = "Выполнено" Тогда
		
		ЗавершитьДлительнуюОперациюНаКлиентеОбщая(РезультатРасчетаДлительнойОперации);
		
	Иначе	
		
		ОткрытьОкноОжиданияЗагрузкиРекомендованныхЦенВФоне("ЗавершитьДлительнуюОперациюНаКлиентеОбщая", "Выгрузка");
		
	КонецЕсли;

КонецПроцедуры  

&НаСервере
Функция ВыгрузитьОстаткиНаСервереВФоне()
	  	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;  
	ПараметрыЗадания = Новый Структура();
	ПараметрыЗадания.Вставить("НемедленноеОбновление",Истина);
		
	ИмяРегламентногоЗадания = "ИнтеграцияСЯндексМаркетСервер.ВыгрузкаОстатковТоваровЯндексМаркет";
	
	РезультатРасчетаДлительнойОперации = ДлительныеОперации.ВыполнитьВФоне(ИмяРегламентногоЗадания,
	ПараметрыЗадания,
	ПараметрыВыполнения);
	
	Возврат РезультатРасчетаДлительнойОперации; 
	
КонецФункции   

&НаКлиенте
Процедура ВыгрузитьОстатки(Команда)
	
	ОчиститьСообщения();  
	
	РезультатРасчетаДлительнойОперации = ВыгрузитьОстаткиНаСервереВФоне();
	
	ИдентификаторЗадания = РезультатРасчетаДлительнойОперации.ИдентификаторЗадания;
	
	Если РезультатРасчетаДлительнойОперации.Статус = "Выполнено" Тогда
		
		ЗавершитьДлительнуюОперациюНаКлиентеОбщая(РезультатРасчетаДлительнойОперации);
		
	Иначе	
		
		ОткрытьОкноОжиданияЗагрузкиРекомендованныхЦенВФоне("ЗавершитьДлительнуюОперациюНаКлиентеОбщая","ВыгрузкаОстатков");
		
	КонецЕсли;
	
КонецПроцедуры
